src/cf/InformationRegisters/СогласияНаОбработкуПерсональныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СогласияНаОбработкуПерсональныхДанных</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектПерсональныхДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФотографии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ЗащитаПерсональныхДанныхДокументооборот/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

#Область УничтожениеПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Физические лица
	МетаданныеФизическиеЛица = Метаданные.Справочники.ФизическиеЛица;
	СтандартныеРеквизиты = МетаданныеФизическиеЛица.СтандартныеРеквизиты;
	Реквизиты = МетаданныеФизическиеЛица.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.ДатаРождения.ПолноеИмя());
	Поля.Добавить(Реквизиты.ФайлФотографии.ПолноеИмя());
	Поля.Добавить(Реквизиты.ИНН.ПолноеИмя());
	Поля.Добавить(Реквизиты.Пол.ПолноеИмя());
	Поля.Добавить(Реквизиты.СтраховойНомерПФР.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация физических лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Контрагенты по реквизиту ФизЛицо
	МетаданныеКонтрагенты = Метаданные.Справочники.Контрагенты;
	СтандартныеРеквизиты = МетаданныеКонтрагенты.СтандартныеРеквизиты;
	Реквизиты = МетаданныеКонтрагенты.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеКонтрагенты.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.НаименованиеПолное.Имя);
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация контрагентов
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Организации по реквизиту ИндивидуальныйПредприниматель (это ссылка на справочник физлиц)
	МетаданныеОрганизации = Метаданные.Справочники.Организации;
	СтандартныеРеквизиты = МетаданныеОрганизации.СтандартныеРеквизиты;
	Реквизиты = МетаданныеОрганизации.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеОрганизации.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ИндивидуальныйПредприниматель.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	ЭлементПДн.Поля = Поля;

	// Контактная информация организаций
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеОрганизации.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ИндивидуальныйПредприниматель.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Контактные лица по реквизиту ФизЛицо
	МетаданныеКонтактныеЛица = Метаданные.Справочники.КонтактныеЛица;
	СтандартныеРеквизиты = МетаданныеКонтактныеЛица.СтандартныеРеквизиты;
	Реквизиты = МетаданныеКонтактныеЛица.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	ЭлементПДн.Поля = Поля;

	// Контактная информация контактных лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);


	// Регистр сведений «Документы физических лиц».
	МетаданныеДокументыФизЛиц = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ДокументыФизЛицРесурсы = МетаданныеДокументыФизЛиц.Ресурсы;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеДокументыФизЛиц.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеДокументыФизЛиц.Измерения.Физлицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ДокументыФизЛицРесурсы.Серия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Номер.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.ДатаВыдачи.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.СрокДействия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КемВыдан.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КодПодразделения.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Представление.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.УдалитьВидДокумента.Имя);
	ЭлементПДн.Поля = Поля;
	
	
	// Пользователи по реквизиту «ФизЛицо»
	МетаданныеПользователи = Метаданные.Справочники.Пользователи;
	СтандартныеРеквизиты = МетаданныеПользователи.СтандартныеРеквизиты;
	Реквизиты = МетаданныеПользователи.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеПользователи.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.ПредставлениеВДокументах.ПолноеИмя());
	Поля.Добавить(Реквизиты.ПредставлениеВПереписке.ПолноеИмя());
	Поля.Добавить(Реквизиты.ПредставлениеВПерепискеСРангом.ПолноеИмя());
	Поля.Добавить(Реквизиты.Фотография.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация физических лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);

	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередУничтожениемПерсональныхДанных
Процедура ПередУничтожениемПерсональныхДанных(Объект, Субъекты, ВыполнитьЗаписьОбъекта) Экспорт

	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
		Объект.Недействителен = Истина;
	КонецЕсли;

КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПослеУничтоженияПерсональныхДанных
Процедура ПослеУничтоженияПерсональныхДанных(Объект, Субъекты) Экспорт

	// Обновление адресной книги
	ТипыАК = Метаданные.Справочники.АдреснаяКнига.Реквизиты.Объект.Тип;
	Если ТипыАК.СодержитТип(ТипЗнч(Объект.Ссылка)) Тогда
		
		Справочники.АдреснаяКнига.ОбновитьДанныеОтображенияПодчиненногоОбъекта(Объект.Ссылка);
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
			
			СоставГруппыВсеПользователи = РаботаСПользователями.ПолучитьВсехПользователей();
			Справочники.АдреснаяКнига.РасширитьСписокПользователейРолями(СоставГруппыВсеПользователи, Ложь);
			Справочники.АдреснаяКнига.ОбновитьСписокПодчиненныхОбъектов(
				Справочники.РабочиеГруппы.ВсеПользователи,
				Неопределено,
				СоставГруппыВсеПользователи,
				Справочники.АдреснаяКнига.ПоРабочимГруппам);
				
			РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоПользователю(Объект);
		
		КонецЕсли;

		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьДоступностьВПоиске(Объект);
		
	КонецЕсли;
	
	// Приведем пользователя ИБ в соответствие пользователю
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
	
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Имя = Объект.Наименование;
			ПользовательИБ.ПолноеИмя = Объект.Наименование;
			ПользовательИБ.АдресЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект,
				Справочники.ВидыКонтактнойИнформации.EmailПользователя);
			
			ПользовательИБ.АутентификацияOpenID = Ложь;
			ПользовательИБ.АутентификацияOpenIDConnect = Ложь;
			ПользовательИБ.АутентификацияОС = Ложь;
			ПользовательИБ.АутентификацияСтандартная = Ложь;
			ПользовательИБ.АутентификацияТокеномДоступа = Ложь;
			ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
			
			ПользовательИБ.Записать();
			
			РегистрыСведений.СведенияОПользователях.ОбновитьДанныеРегистра(Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриРасчетеСроковХраненияПерсональныхДанных
Процедура ПриРасчетеСроковХраненияПерсональныхДанных(ДанныеСубъектов, СрокиХранения) Экспорт

	// Рассчитываем срок хранения ПДн с учетом наличия согласий на обработку
	// Если есть согласие, и в нем указан срок, берем этот срок. Если срок не указан - храним бессрочно.
	// Если после согласия есть отзыв, берем срок из него.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Субъект,
		|	&ДатаНеУничтожать КАК СрокХранения
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласияНаОбработкуПерсональныхДанных.СрезПоследних(, Субъект В (&Субъекты)) КАК
		|			СогласияНаОбработкуПерсональныхДанныхСрезПоследних
		|		ПО (ФизическиеЛица.Ссылка = СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект)
		|ГДЕ
		|	ФизическиеЛица.Ссылка В (&Субъекты)
		|	И СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Субъекты", ДанныеСубъектов.ВыгрузитьКолонку("Субъект"));
	Запрос.УстановитьПараметр("ДатаНеУничтожать", ДатаНеУничтожать());
	
	ФизлицаИСрокиХранения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ФизлицаИСрокиХранения Цикл
	
		НоваяСтрока = СрокиХранения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн)
	
	Поля = Новый Массив; // Массив из Строка 
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.ЗначенияПолей.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Значение.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Представление.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.АдресЭП.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефона.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефонаБезКодов.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "КонтактнаяИнформация";
	
КонецПроцедуры

// Возвращаемое значение:
//  Дата
Функция ДатаНеУничтожать() Экспорт
	
	Возврат Дата(3999, 12, 31);
	
КонецФункции

#КонецОбласти
